# GetAllExternalResourceReferences Method (Document) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceUtils..::..GetAllExternalResourceReferences Method (Document)
ExternalResourceUtils Class See Also
---
Gets the ids of all elements which refer to external resources.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static ISet<ElementId> GetAllExternalResourceReferences(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function GetAllExternalResourceReferences ( _
	document As Document _
) As ISet(Of ElementId)
```

Visual C++
---
```text
public:
static ISet<ElementId^>^ GetAllExternalResourceReferences(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The Revit Document containing the external resource references.
# ### Return Value
The ids of all elements which refer to external resources.
# Remarks
This function will not return the ids of nested Revit links; it only returns top-level references.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExternalResourceUtils Class
GetAllExternalResourceReferences Overload
Autodesk.Revit.DB Namespace